# 26/11/2025--->Data frames

# step1: import packages

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Step2: Create a Df using list

In [2]:
names=['sneha','madhu','latha']
#pd.DataFrame(data, index, columns)
pd.DataFrame(names)

       0
0  sneha
1  madhu
2  latha

# Step3:

In [3]:
names=['sneha','madhu','latha']
ids=['A','B','C']
pd.DataFrame(names,ids)

       0
A  sneha
B  madhu
C  latha

In [4]:
names=['sneha','madhu','latha']
ids=['A','B','C']
cols=['names']
pd.DataFrame(names,ids,cols)

   names
A  sneha
B  madhu
C  latha

In [5]:
names=['sneha','madhu','latha']
cols=['names']
pd.DataFrame(names,cols)  ### DF goes in order ----------->#pd.DataFrame(data, index, columns)

# so give argument

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)

In [6]:
names=['sneha','madhu','latha']
cols=['names']
pd.DataFrame(names,columns=cols)

   names
0  sneha
1  madhu
2  latha

# Step6-Multiple columns

In [7]:
names=['sneha','madhu','latha']
age=[20,22,24]
pd.DataFrame(names,age)  

#age is considerd as index
# get only as 1 colum

        0
20  sneha
22  madhu
24  latha

**Zip uses to combine**

In [8]:
names=['sneha','madhu','latha']
age=[20,22,24]
pd.DataFrame(zip(names,age)) 

#Zip to combine to lists

       0   1
0  sneha  20
1  madhu  22
2  latha  24

In [9]:
names=['sneha','madhu','latha']
age=[20,22,24]
cols=['names','age']
pd.DataFrame(zip(names,age),columns=cols)

   names  age
0  sneha   20
1  madhu   22
2  latha   24

In [10]:
names=['sneha','madhu','latha']
age=[20,22,24]
sal=[10000,20000,30000]
cols=['names','age','sal']
df=pd.DataFrame(zip(names,age,sal),columns=cols)

# Step7 : Add a new column to already existed DF

- in above first we have taken data

- then created a dataframe

- now we want to add new data baesd on the requirement

- it takes exact cloums or rows previously exists

- does not craete **NULL** values

In [11]:
city=['pune','hyd']
df['City']=city
df

ValueError: Length of values (2) does not match length of index (3)

In [13]:
city=['pune','hyd','chennai']
df['states']=city
df

   names  age    sal   states
0  sneha   20  10000     pune
1  madhu   22  20000      hyd
2  latha   24  30000  chennai

In [14]:
df['marks']=[20,30,50]
df

   names  age    sal   states  marks
0  sneha   20  10000     pune     20
1  madhu   22  20000      hyd     30
2  latha   24  30000  chennai     50

# Step8: Update the column with new values

In [15]:
df['marks']

0    20
1    30
2    50
Name: marks, dtype: int64

In [16]:
df['marks']=[200,100,300]        ## creating new column or updating is same
df

   names  age    sal   states  marks
0  sneha   20  10000     pune    200
1  madhu   22  20000      hyd    100
2  latha   24  30000  chennai    300

# Step9:create empty data frames and add columns

In [17]:
##each Start word is capitalized

df=pd.DataFrame()
df['names']=['sneha','madhu','latha']
df['age']=[20,22,24]
df['city']=['pune','hyd','chennai']
df

   names  age     city
0  sneha   20     pune
1  madhu   22      hyd
2  latha   24  chennai

# step 10: create DF using dictionary

In [18]:
d={'names':['sneha','madhu','latha'],
  'age':[20,22,24],
  'city':['pune','hyd','chennai']}
df=pd.DataFrame(d)      ## df is a df_name
df

   names  age     city
0  sneha   20     pune
1  madhu   22      hyd
2  latha   24  chennai

In [19]:
d={'names':'sneha',
  'age': 20,
  'city':'pune'}
df=pd.DataFrame(d)
df

#scalar values-----single values

ValueError: If using all scalar values, you must pass an index

In [20]:
d={'names':'sneha',
  'age': 20,
  'city':'pune'}
pd.DataFrame(d,index=[0])

   names  age  city
0  sneha   20  pune

# step11: Saving the data frames

In [21]:
# file handling
# directory//filename.ext

df.to_csv('data.csv')

In [22]:
df.to_excel('data.xlsx')

## data.csv file created in the current directory(Ds my_notes)

In [23]:
#csv takes less memory
#xlsx takes more memory

# 27/11/2025--->

# Step12: read the DataFrame

- in order to read the data

- fielname.ext

- open(mobox-short.txt).read()

- open(dumpy.txt,module='w').write('hello')

In [27]:
pd.read_csv('data.csv')

   Unnamed: 0  names  age     city
0           0  sneha   20     pune
1           1  madhu   22      hyd
2           2  latha   24  chennai

In [30]:
df

   names  age     city
0  sneha   20     pune
1  madhu   22      hyd
2  latha   24  chennai

In [29]:
pd.read_excel('data.xlsx')

   Unnamed: 0  names  age     city
0           0  sneha   20     pune
1           1  madhu   22      hyd
2           2  latha   24  chennai

- to avoid the new column

In [32]:
names=['sneha','madhu','latha']
age=[20,22,24]
sal=[10000,20000,30000]
cols=['names','age','sal']
df=pd.DataFrame(zip(names,age,sal),columns=cols)
df

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

- df.to_csv

- pd.read_csv

- df.to_excel

- pd.read_excel

In [35]:
df.to_csv('data1.csv',index=False)

In [36]:
pd.read_csv('data1.csv')

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

In [37]:
df.to_excel('data1.xlsx',index=False)
pd.read_excel('data1.xlsx')

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

In [40]:
# add one more colum marks to df

names=['sneha','madhu','latha']
age=[20,22,24]
sal=[10000,20000,30000]
marks=[100,300,50]
cols=['names','age','sal','marks']
df=pd.DataFrame(zip(names,age,sal,marks),columns=cols)
df

   names  age    sal  marks
0  sneha   20  10000    100
1  madhu   22  20000    300
2  latha   24  30000     50

In [41]:
# df['marks']=[100,200,300]

# this is used to add the extra columm

# Step13: drop the column

- df.drop(

    labels:
    
    axis: 'Axis' = 0,
    
    index=None,
    
    columns=None,
    
    level: 'Level | None' = None,
    
    inplace: 'bool' = False,
    
    errors: 'str' = 'raise',
)

In [45]:
df.drop(index=1)

# give the argument name

   names  age    sal  marks
0  sneha   20  10000    100
2  latha   24  30000     50

In [47]:
df.drop(columns='marks')

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

In [49]:
df.drop(columns='sal')

   names  age  marks
0  sneha   20    100
1  madhu   22    300
2  latha   24     50

In [50]:
df  

## still dropping the col we get entire the data frame

   names  age    sal  marks
0  sneha   20  10000    100
1  madhu   22  20000    300
2  latha   24  30000     50

# index======>axis=0

- df.drop(index=1)

- df.drop(columns='marks')

------------------------------------------

- df.drop('marks') # if i dont give argument label

- df.drop(1)       # 1 become label

###  we need to provide axis

### axis=0 indicates index

### axis=1 indicates columns

In [51]:
df.drop('marks',axis=1)

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

In [52]:
df.drop('marks',axis=0)

KeyError: "['marks'] not found in axis"

In [53]:
df.drop(columns='marks')

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

In [54]:
df.drop(index=1)

   names  age    sal  marks
0  sneha   20  10000    100
2  latha   24  30000     50

# inplace

- when we do the operation the result output is not over

- means the original dataframe is as it is.

- inorder to do this we need to use **inplace**

- by default inplace=False

- make **inplace=True** if you want overrite result

In [56]:
df.drop('marks',axis=1,inplace=True)

In [57]:
df

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

# Step14: Rename the column

In [58]:
df

   names  age    sal
0  sneha   20  10000
1  madhu   22  20000
2  latha   24  30000

In [62]:
d={'sal':'SALARY'}   # mappers used in dictionary
df.rename(d,axis=1,inplace=True)

df

   names  age  SALARY
0  sneha   20   10000
1  madhu   22   20000
2  latha   24   30000

In [ ]:
d={2:'a'}   # mappers used in dictionary
df.rename(d,axis=0,inplace=True)

df

In [71]:
## craete the dta frame

x=list(range(1,11))

y=[i*i for i in x]

z=[i**3 for i in x]

df=pd.DataFrame(zip(x,y,z),
               columns=['x','y','z'])
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

- len

- shape

- size

- head

- tail

- isnull

- dtypes

- info

In [72]:
len(df)

10

In [74]:
df.shape

(10, 3)

In [75]:
df.size

30

In [76]:
df.head

<bound method NDFrame.head of     x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000>

In [77]:
df.tail

<bound method NDFrame.tail of     x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000>

In [78]:
df.isnull()

       x      y      z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [80]:
df.dtypes

# if any categorical columns occures

# it represents as 'objects' instaed of string

#

x    int64
y    int64
z    int64
dtype: object

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       10 non-null     int64
 1   y       10 non-null     int64
 2   z       10 non-null     int64
dtypes: int64(3)
memory usage: 368.0 bytes

In [82]:
df.isnull().sum()

x    0
y    0
z    0
dtype: int64

# Step15: select columns

In [84]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [85]:
df['x']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: x, dtype: int64

In [86]:
df[['x','y']]  # selecting multpile cloumns ----use [[  ]]

    x    y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [87]:
#col=2,
# rows=10

# shape=(2,10)

# 2D---[[ ]]

#1d=======series

#2d=========dataframes

In [88]:
type(df['x']) #1D

pandas.core.series.Series

In [90]:
type(df[['x','y']])  #2D

pandas.core.frame.DataFrame

In [91]:
df['x'].shape

(10,)

In [93]:
df[['x','y']].shape

(10, 2)

In [94]:
df # data frames
df['x']   # selecting one particular column

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: x, dtype: int64

In [95]:
df['x'].values # extracting the data

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [96]:
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [97]:
df[['y','z']]

     y     z
0    1     1
1    4     8
2    9    27
3   16    64
4   25   125
5   36   216
6   49   343
7   64   512
8   81   729
9  100  1000

In [98]:
df[['y','z']].values

array([[   1,    1],
       [   4,    8],
       [   9,   27],
       [  16,   64],
       [  25,  125],
       [  36,  216],
       [  49,  343],
       [  64,  512],
       [  81,  729],
       [ 100, 1000]], dtype=int64)

In [99]:
df['z'].values.tolist()    # data frames into list converting

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]